{
  "illandril-sheet5e-lockdown.setting.hideFromEveryone": "Hide from Everyone",

  "illandril-sheet5e-lockdown.setting.showToggleEditRole.label": "Show Toggle Edit To",
  "illandril-sheet5e-lockdown.setting.showToggleEditRole.hint": "A Toggle Edit button will be shown to all users with at least the selected role, allowing them to modify all locked settings. Note: Changing this option will not impact already opened character sheets. Players will need to close and re-open their character sheet to see this change.",

  "illandril-sheet5e-lockdown.setting.lockToggleStyle.label": "Lock Toggle Style",
  "illandril-sheet5e-lockdown.setting.lockToggleStyle.choice_full": "Icon, Label, and Help",
  "illandril-sheet5e-lockdown.setting.lockToggleStyle.choice_iconPlusLabel": "Icon and Label",
  "illandril-sheet5e-lockdown.setting.lockToggleStyle.choice_labelOnly": "Label Only",
  "illandril-sheet5e-lockdown.setting.lockToggleStyle.choice_iconOnly": "Icon Only",

  "illandril-sheet5e-lockdown.setting.lockName.label": "Lock Name",
  "illandril-sheet5e-lockdown.setting.lockBasicDetails.label": "Lock Basic Details",
  "illandril-sheet5e-lockdown.setting.lockBasicDetails.hint": "Basic Details include Race, Background, Alignment, and Size",

  "illandril-sheet5e-lockdown.setting.showBackgroundRole.label": "Show Background To",
  "illandril-sheet5e-lockdown.setting.showBackgroundRole.hint": "A character's background will be hidden (even when the character sheet is unlocked) from players who do not have at least the selected role.",
  "illandril-sheet5e-lockdown.setting.showAlignmentRole.label": "Show Alignment To",
  "illandril-sheet5e-lockdown.setting.showAlignmentRole.hint": "A character's alignment will be hidden (even when the character sheet is unlocked) from players who do not have at least the selected role.",
  "illandril-sheet5e-lockdown.setting.lockXP.label": "Lock Experience",
  "illandril-sheet5e-lockdown.setting.lockRests.label": "Lock Short and Long Rests",

  "illandril-sheet5e-lockdown.setting.lockAbilityScores.label": "Lock Ability Scores",
  "illandril-sheet5e-lockdown.setting.lockProficiencies.label": "Lock Proficiencies",
  "illandril-sheet5e-lockdown.setting.lockResources.label": "Lock Resources",
  "illandril-sheet5e-lockdown.setting.lockResources.hint": "Locks the name, maximum value, and reset on short/long rest toggles for Resource 1, 2, and 3. This does not lock the current value for resources. If a resource is locked, has no name, and has a maximum of 0, it will be hidden.",
  "illandril-sheet5e-lockdown.setting.lockTraits.label": "Lock Traits",
  "illandril-sheet5e-lockdown.setting.lockTraits.hint": "Traits include Senses, Languages, Immunities/Resistances/Vulnerabilities, Weapon/Armor/Tool Proficiencies, and Special Traits. If a trait is locked and has no value, it will be hidden.",
  "illandril-sheet5e-lockdown.setting.lockLegendaryAndLair.label": "Lock Legendary and Lair Actions",
  "illandril-sheet5e-lockdown.setting.lockLegendaryAndLair.hint": "Locks the maximum value for legendary actions and resistances, and the flag and initiative value for Uses Lair Action. The available value for Legendary Actions and Resistance is not locked. The Legendary and Lair rows are hidden when locked if the creature has no Legendary or Lair Actions.",
  "illandril-sheet5e-lockdown.setting.showSpecialTraits.label": "Show Special Traits",
  "illandril-sheet5e-lockdown.setting.showSpecialTraits.hint": "Show the list of Special Traits (Diamond Soul, Elven Accuracy, Attack Bonuses, etc) on the character sheet.",

  "illandril-sheet5e-lockdown.setting.hideAddItemButtons.label": "Hide Add Item Buttons",
  "illandril-sheet5e-lockdown.setting.hideAddItemButtons.hint": "If checked, the Add buttons are hidden on the Inventory, Features, and Spellbook tabs. Note: Items can still be added through Drag and Drop even when locked.",
  "illandril-sheet5e-lockdown.setting.hideRemoveItemButtons.label": "Hide Delete Item Buttons",
  "illandril-sheet5e-lockdown.setting.hideRemoveItemButtons.hint": "If checked, the Delete buttons are hidden on the Inventory, Features, and Spellbook tabs.",
  "illandril-sheet5e-lockdown.setting.hideEmptySpellbook.label": "Hide Empty Spellbooks",
  "illandril-sheet5e-lockdown.setting.hideEmptySpellbook.hint": "If checked, the Spellbook tab will be hidden when the character sheet is locked and the character has no spells, regardless of the Hide Add and Delete Item Buttons setting. If unchecked, the Spellbook tab for characters with no spells will be hidden or shown based on the Hide Add and Delete Item Buttons setting when the character sheet is locked.",
  "illandril-sheet5e-lockdown.setting.hideEditItemButtons.label": "Hide Edit Item Buttons",
  "illandril-sheet5e-lockdown.setting.hideEditItemButtons.hint": "This setting impacts Inventory, Features, and Spellbook",

  "illandril-sheet5e-lockdown.setting.lockCurrency.label": "Lock Currency",
  "illandril-sheet5e-lockdown.setting.lockEquipItemButtons.label": "Lock Equip Item Toggles",

  "illandril-sheet5e-lockdown.setting.lockAvailableItemFeatureUses.label": "Lock Available Item and Feature Uses",

  "illandril-sheet5e-lockdown.setting.lockPrepareSpellButtons.label": "Lock Prepare Spell Toggles",
  "illandril-sheet5e-lockdown.setting.lockAvailableSpellSlots.label": "Lock Available Spell Slots",
  "illandril-sheet5e-lockdown.setting.lockMaxSpellSlotOverride.label": "Lock Max Spell Slots Overrides",

  "illandril-sheet5e-lockdown.setting.lockEffects.label": "Lock Effects",
  "illandril-sheet5e-lockdown.setting.lockEffects.hint": "Note: This only impacts the Effects tab in the character sheet, and does not prevent players from adding/removing active effecits from the Token HUD.",

  "illandril-sheet5e-lockdown.setting.showEffectsRole.label": "Show Effects Tab To",
  "illandril-sheet5e-lockdown.setting.showEffectsRole.hint": "The Effects tab will be hidden (even when the character sheet is unlocked) from players who do not have at least the selected role. If Effects are locked, and a character has no effects (including inactive effects), the Effects tab will be hidden when the character sheet is locked regardless of this setting.",

  "illandril-sheet5e-lockdown.setting.showBiographyRole.label": "Show Biography To",
  "illandril-sheet5e-lockdown.setting.showBiographyRole.hint": "The Biography tab will be hidden (even when the character sheet is unlocked) from players who do not have at least the selected role.",

  "illandril-sheet5e-lockdown.setting.lockUnsorteds.label": "Lock Other Inputs",
  "illandril-sheet5e-lockdown.setting.lockUnsorteds.hint": "Locks Max Hit Points, Armor Class, Speed, Initiative Modifier, and Spellcasting Attribute. If you want to control any of these individually (or have any other issues with this module), please open an issue on this module's GitHub project page: https://github.com/illandril/FoundryVTT-sheet5e-lockdown",

  "illandril-sheet5e-lockdown.setting.disableTidy5eSheet.label": "Disable Tidy5e Sheet Support",
  "illandril-sheet5e-lockdown.setting.disableTidy5eSheet.hint": "WARNING: Illandril's Character Sheet Lockdown is at risk of dropping support for Tidy5e Sheet at some point in the future, as Tidy5e Sheet has too many substantial differences from the default Character Sheets, including some that overlap with features provided by Illandril's Character Sheet Lockdown, which makes it extremely burdensome to continue supporting. If there are features that you use from Illandril's Character Sheet Lockdown with Tidy5e Sheets that are not already implemented directly in Tidy5e Sheet, Illandril recommends you open an issue on the Tidy5e Sheet GitHub page to request those features be added directly in Tidy5e Sheet so you no longer need to rely on both modules working together: https://github.com/sdenec/tidy5e-sheet/issues\nIllandril's Character Sheet Lockdown will continue to suppor the default sheets and custom sheets that do not add as many features as Tidy5e Sheet even if Tidy5e Sheet suppport is dropped.\nIf you encounter issues with this module and Tidy5e Sheet, but don't want to fully disable this module because you use a mix of both standard and Tidy5e sheets, you can disable only the Tidy5e Sheet support. If you do encounter problems with this module (in Tidy5e sheets or elsewhere), please open an issue on this module's GitHub project page: https://github.com/illandril/FoundryVTT-sheet5e-lockdown - if the fix is simple enough, I will still fix it and keep Tidy5e Sheet support. I will only drop Tidy5e Sheet support if and when a substantial enough issue comes along that would require too much effort to fix for me to consider it worthwhile.",

  "illandril-sheet5e-lockdown.setting.disableOtherSheets.label": "Disable Other Sheet Support",
  "illandril-sheet5e-lockdown.setting.disableOtherSheets.hint": "This module can attempt to lock down all other custom Character and NPC sheets, but they are not guaranteed to work (and may even make some sheets completely unusable). If you are using a sheet other than the base DnD5e sheets or Tidy5e, please open an issue on this module's GitHub project page to request official support: https://github.com/illandril/FoundryVTT-sheet5e-lockdown",

  "illandril-sheet5e-lockdown.warning.tidy5eSheetSupport": "Illandril's Character Sheet Lockdown may not work with Tidy5e Sheet in future releases. See the notes under the Disable Tidy5e Sheet Support setting for Illandril's Character Sheet Lockdown settings for more details.",

  "illandril-sheet5e-lockdown.toggleEditOn": "Locked (Click to Unlock)",
  "illandril-sheet5e-lockdown.toggleEditOnShort": "Locked",
  "illandril-sheet5e-lockdown.toggleEditOff": "Unlocked (Click to Lock)",
  "illandril-sheet5e-lockdown.toggleEditOffShort": "Unlocked"
}
